{"id":266515,"name":"Elven Gods","created_at":"2024-10-31T16:14:04.000000Z","updated_at":"2025-06-03T17:26:00.000000Z","is_private":0,"note_id":266514,"entity":{"id":6861797,"entity_id":266515,"parent_id":null,"type_id":6,"name":"Elven Gods","type":"Religion","entry":"<p class=\"p1\" style=\"font-size:17px;color:rgb(0,0,0);\"><span class=\"s1\" style=\"font-family:UICTFontTextStyleBody;\">In the early days of gods and men, the divine trod the earth with mortals, befriended them, ravished them, coupled with them, punished them, tormented them, transformed them into flowers, trees, birds, and bugs, and in all ways interacted, intersected, intertwined, interbred, interpenetrated, and interfered with us. But over time, as age has succeeded age and humankind has grown and prospered, the intensity of these interrelations has slowly diminished.<\/span><\/p><p class=\"p1\" style=\"font-size:17px;color:rgb(0,0,0);\"><span class=\"s1\" style=\"font-family:UICTFontTextStyleBody;\">In the age we have entered now, the gods are still very much around, favoring,<\/span><\/p><p><span style=\"font-family:UICTFontTextStyleBody;color:rgb(0,0,0);font-size:17px;\">disfavoring, directing, and disturbing, but Prometheus’ gift of fire has given mortals the ability to run its own affairs, build up its distinct city-states, kingdoms, and dynasties. The fire is real and hot in the world and has given mortals the power to smelt, forge, fabricate, and make, but it is an inner fire too; thanks to Prometheus we are now endowed with the divine spark, the creative and magical fire, the powers that once belonged only to gods.<\/span><\/p><p><br><\/p><p>Notes:Elves are fluid in their worship and depending on the clerical sub-class they've chosen, they may find suitable focus with one or more of the following and it's not unusual for others to show devotion to any and all of the gods depending on where they are in life:<\/p><p><b>Apollo<\/b>, the Elven god, embodies <b>light, knowledge, prophecy, healing, music, poetry, and the arts (Lawful Good)<\/b>. Similar to his Greek counterpart, he is often depicted as a radiant and youthful figure, associated with the sun and its life-giving energy.<\/p><p>However, in Elven mythology, Apollo's connection to nature is even more pronounced. He is often seen as the guardian of forests and the patron of bards, who use their music to heal and inspire. He is also deeply connected to the cycles of the seasons, representing the rebirth and renewal of life. (bard, cleric, Monk, ranger, sorcerer, Wizard) white raven &amp; dolphin<\/p><p><b>Hermes (The Androgynous Messenger - Chaotic Good)<\/b> is a being of fluid identity, embodying the spectrum of gender and the interconnectedness of all things. They are the patron of <b>communication, travel, trade, theft, and trickery<\/b>. As the messenger of the gods, Hermes is the conduit between the divine and mortal realms, bridging the gap between different worlds and perspectives.<\/p><p>Unlike their Greek counterpart, Elven Hermes is not solely associated with male attributes. They are often depicted as a beautiful and androgynous figure, capable of shifting appearance to suit any situation. Their role as the patron of trade and communication emphasizes their ability to connect with people from all walks of life and to understand the complexities of human interaction.<\/p><p>Hermes is also the <b>protector of travelers<\/b> and the guide of souls in the afterlife, symbolizing the journey of self-discovery and the transition between different stages of life. (Rogue, Monk, Bard, Wizard)<\/p><p><b>Hera<\/b> is the formidable<b> Queen of the Gods (Neutral)<\/b>. As the embodiment of <b>marriage, family, childbirth, and women<\/b>, she is a powerful and complex figure. Respected for her wisdom and compassion, Hera is also known for her fierce loyalty and unwavering determination.<\/p><p>Her Priestess remove their tongues at Higher levels so that they may listen to confessions and maintain privacy.<br><\/p><p>Her relationship with Zeus is a cornerstone of Elven mythology, marked by both deep love and intense rivalry. As the protector of marriage and family, Hera is deeply wounded by Zeus's infidelities. Her jealousy and anger are legendary, and she is not afraid to use her power to punish those who have wronged her. Despite her flaws, Hera is a beloved figure among mortals, seen as a symbol of maternal love and protection. (Cleric, Paladin, Druid)<\/p><p><b>Hephaestus (Master of Craft - Neutral Good)<\/b> is the god of <b>fire, metalworking, and craftsmanship<\/b>. Unlike his Greek counterpart, who is often depicted as a blacksmith, the Elven Hephaestus is more of an artisan, skilled in a wide range of crafts, from jewelry making to woodworking.<\/p><p>He is seen as the patron of innovation and creativity, inspiring artists and inventors alike. Hephaestus is also associated with the hearth and home, symbolizing warmth, comfort, and the bonds of family. Despite his skill and power, he is often portrayed as a gentle and humble deity, finding joy in the process of creation. (Artificer, Fighter, Warlock, Wizard)<\/p><p><b>Dionysus (Ecstasy &amp; Liberation - Chaotic Neutral)<\/b> is a divine embodiment of <b>ecstasy, liberation, and the celebration of life<\/b>. Transcending traditional gender roles, Dionysus welcomes all expressions of identity and sexuality. They are a patron of revelry, creativity, and the exploration of the human experience.<\/p><p>Dionysus is deeply connected to nature, embodying the wild and untamed spirit of the forest. Their festivals are known for their inclusivity and acceptance, where people from all walks of life come together to celebrate their shared humanity.Dionysus inspires a sense of freedom and belonging, encouraging individuals to embrace their true selves without judgment. (Bard, Druid, Barbarian)<\/p><p><b>Aphrodite (Divine Love &amp; Beauty - Chaotic Neutral)<\/b> is a divine being transcending gender, embodying the <b>essence of love, beauty, desire, and pleasure<\/b>. They are a symbol of unity and harmony, representing the interconnectedness of all things. Aphrodite's love is all-encompassing,extending beyond romantic relationships to include familial bonds, friendships, and self-love.<\/p><p>As a being of divine beauty, Aphrodite inspires creativity, art, and the appreciation of the natural world. They are a patron of artists, musicians, and poets, encouraging the expression of the soul. Aphrodite's love is a force for good, promoting peace, compassion, and understanding among all beings. (Bard, Sorcerer, Warlock)<\/p><p><b>Ares (Valor &amp; Competition - Chaotic Evil)<\/b> is the deity of valor, courage, competition, and strategic thinking. Unlike their Greek counterpart, who is often associated with brutal violence, the Elven Ares is a more refined and noble figure. They embody the spirit of the warrior,but also the wisdom and discipline necessary for victory.<\/p><p>Ares is the patron of <b>athletes, soldiers, and leaders, inspiring courage and determination<\/b> in the face of adversity. They are also associated with justice and honor, as these are the foundations of a strong and just society. (Fighter, Barbarian, Paladin, Monk)<\/p><p><b>Artemis<\/b> is the embodiment of the <b>wild, the moon, and the feminine spirit (Neutral Good)<\/b>. She is a powerful and independent goddess, associated with nature, wilderness, childbirth, and the protection of young women.<\/p><p>Unlike her Greek counterpart, Elven Artemis is not solely associated with <b>hunting<\/b>. While she is a skilled archer and protector of animals, she is also seen as a nurturer and guardian of life. She is the patroness of midwives and young mothers, symbolizing the power and mystery of childbirth. <\/p><p>Artemis is deeply connected to the lunar cycle, representing <b>the ebb and flow of life<\/b>. She is often depicted as a beautiful and ethereal figure, surrounded by wildlife and moonlight. Her presence inspires a deep connection to nature and a reverence for the natural world. (Ranger, Druid, Rogue) - wolf &amp; stag<\/p><p><b>Furies, The <\/b>are said to haunt murder hobos and take vengeance on mortals who have sworn false oaths. They are invisible except to the oathbreakers, but to them, they appear as fierce-looking winged women with snakes for hair. They are said to be dauntless in their pursuit and gleeful in administering their punishment.<\/p><p><b>Hades (Lawful Neutral)<\/b> is the ruler of the underworld, a realm of transformation and renewal rather than eternal punishment. He is the <b>god of the dead, the underworld, wealth, and the earth<\/b>. Unlike his Greek counterpart, Elven Hades is not a malevolent figure but a wise and compassionate ruler.<\/p><p>He is often depicted as a guardian of souls, guiding them through the process of transformation after death. The underworld in Elven mythology is a place of rest and reflection, where souls prepare for their next incarnation. Hades is also associated with the earth's bounty, as the underworld is seen as the source of all life. (Warlock, Cleric, Rogue, Wizard)<\/p><p><b>Poseidon<\/b> is the powerful god of the <b>sea, oceans, rivers, and all bodies of water (Chaotic Neutral)<\/b>. Unlike his Greek counterpart, often depicted as tempestuous and unpredictable, the Elven Poseidon is a more benevolent and nurturing figure. He is seen as the protector of seafarers and fishermen, providing guidance and safety to those who venture into the water.<\/p><p>Poseidon is also deeply connected to the natural world, embodying the power and mystery of the ocean. He is often depicted as a wise and ancient being, with a calm and serene demeanor. His dominion extends far beyond the surface of the water, influencing tides, storms, and the very life that thrives within the depths. (Druid, Cleric, Fighter)<\/p><p><b>Zeus (Neutral)<\/b> is the powerful and charismatic <b>King of the Gods<\/b>. As the embodiment of <b>sky, thunder, law, and order<\/b>, he rules over the pantheon with a complex blend of wisdom, strength, and fallibility. A natural leader, Zeus is revered for his justice and his unwavering commitment to maintaining cosmic balance.<\/p><p>His relationship with <b>Hera<\/b> is a dynamic and often tumultuous one. While they are the ruling power couple of the pantheon, their marriage is marked by both deep affection and frequent clashes. Zeus, like many powerful beings, is not without his flaws, and his extramarital affairs have been a constant source of contention between the divine pair. Despite their differences, they are bound by a complex and enduring bond, their love for each other often eclipsed by their pride and ambition. (Paladin, Cleric, Sorcerer, Wizard)<\/p>","is_private":0,"tooltip":null,"is_template":null,"is_attributes_private":0,"focus_x":null,"focus_y":null,"created_at":"2024-10-31T16:14:04.000000Z","updated_at":"2025-06-03T17:26:00.000000Z","created_by":218702,"updated_by":218702,"image_path":null,"image_uuid":"9d616e8a-9774-4bf4-a525-2892454460db","header_image":null,"header_uuid":null,"marketplace_uuid":null,"posts":[{"id":927526,"name":"WIP - Elven Clerical Domains","entry":"<h3 style=\"color:rgb(0,0,0);\"><br><\/h3><ul style=\"color:rgb(0,0,0);\"><li><p><strong>Apollo (God of the Sun, Music, Prophecy, Healing, Archery):<\/strong><\/p><ul><li><strong>Primary:<\/strong> <strong>Light<\/strong> (as the Sun God), <strong>Knowledge<\/strong> (prophecy, healing arts, divine inspiration).<\/li><li><strong>Secondary:<\/strong> <strong>Life<\/strong> (healing aspects), <strong>Arcana<\/strong> (divine inspiration, prophecy).<\/li><\/ul><\/li><li><p><strong>Hermes (Messenger of the Gods, God of Travel, Commerce, Thieves, Orators):<\/strong><\/p><ul><li><strong>Primary:<\/strong> <strong>Trickery<\/strong> (cunning, thievery, deception).<\/li><li><strong>Secondary:<\/strong> <strong>Knowledge<\/strong> (messenger, communication, secrets), <strong>Twilight<\/strong> (as a psychopomp, guiding souls through liminal spaces).<\/li><\/ul><\/li><li><p><strong>Hera (Queen of the Gods, Goddess of Marriage, Women, Childbirth, Family):<\/strong><\/p><ul><li><strong>Primary:<\/strong> <strong>Order<\/strong> (upholder of marriage and social order), <strong>Life<\/strong> (childbirth, family vitality).<\/li><li><strong>Secondary:<\/strong> <strong>Peace<\/strong> (for domestic harmony, though she's also known for wrath).<\/li><\/ul><\/li><li><p><strong>Hephaestus (God of Blacksmiths, Craftsmen, Fire, Volcanoes):<\/strong><\/p><ul><li><strong>Primary:<\/strong> <strong>Forge<\/strong> (the quintessential god of craftsmanship and metalworking).<\/li><li><strong>Secondary:<\/strong> <strong>Knowledge<\/strong> (mastery of craft and invention), <strong>Order<\/strong> (creating structure from raw materials).<\/li><\/ul><\/li><li><p><strong>Dionysus (God of Wine, Revelry, Fertility, Madness, Theater):<\/strong><\/p><ul><li><strong>Primary:<\/strong> <strong>Nature<\/strong> (fertility, vines, wild growth), <strong>Life<\/strong> (vitality, passion, ecstasy).<\/li><li><strong>Secondary:<\/strong> <strong>Trickery<\/strong> (illusions, subverting norms, madness), <strong>Twilight<\/strong> (liminal states between sanity and madness, day and night).<\/li><\/ul><\/li><li><p><strong>Aphrodite (Goddess of Love, Beauty, Pleasure, Procreation):<\/strong><\/p><ul><li><strong>Primary:<\/strong> <strong>Life<\/strong> (procreation, vitality, romantic love), <strong>Light<\/strong> (beauty, allure, radiance).<\/li><li><strong>Secondary:<\/strong> <strong>Peace<\/strong> (inspiring harmony and desire), <strong>Trickery<\/strong> (seduction, charming illusions).<\/li><\/ul><\/li><li><p><strong>Ares (God of War, Battle, Bloodlust):<\/strong><\/p><ul><li><strong>Primary:<\/strong> <strong>War<\/strong> (the epitome of martial conflict and aggression).<\/li><li><strong>Secondary:<\/strong> <strong>Death<\/strong> (the brutal consequence of his domain).<\/li><\/ul><\/li><li><p><strong>Artemis (Goddess of the Hunt, Wilderness, Wild Animals, the Moon, Chastity, Childbirth):<\/strong><\/p><ul><li><strong>Primary:<\/strong> <strong>Nature<\/strong> (wilderness, animals, hunt), <strong>Life<\/strong> (protection of the young, childbirth).<\/li><li><strong>Secondary:<\/strong> <strong>Twilight<\/strong> (as a moon goddess, traversing the wilderness at dusk and dawn).<\/li><\/ul><\/li><li><p><strong>Hades (God of the Underworld, the Dead, Wealth of the Earth):<\/strong><\/p><ul><li><strong>Primary:<\/strong> <strong>Death<\/strong> (ruler of the dead), <strong>Grave<\/strong> (guardian of the dead, sanctity of tombs).<\/li><li><strong>Secondary:<\/strong> <strong>Knowledge<\/strong> (secrets of the underworld, fates of the departed), <strong>Twilight<\/strong> (his shadowed realm).<\/li><\/ul><\/li><li><p><strong>Poseidon (God of the Sea, Earthquakes, Storms, Horses):<\/strong><\/p><ul><li><strong>Primary:<\/strong> <strong>Tempest<\/strong> (master of storms and the raging sea), <strong>Nature<\/strong> (ruler of the ocean and its creatures).<\/li><li><strong>Secondary:<\/strong> <strong>Order<\/strong> (the powerful, sometimes chaotic, forces of nature that he embodies can also bring structure).<\/li><\/ul><\/li><li><p><strong>Zeus (King of the Gods, God of the Sky, Lightning, Thunder, Law, Order, Justice):<\/strong><\/p><ul><li><strong>Primary:<\/strong> <strong>Tempest<\/strong> (wielder of lightning and thunder), <strong>Order<\/strong> (as the supreme ruler and enforcer of divine law and cosmic balance).<\/li><li><strong>Secondary:<\/strong> <strong>Light<\/strong> (god of the sky and heavenly light), <strong>Knowledge<\/strong> (divine judgment, ultimate authority).<\/li><\/ul><\/li><\/ul>","is_private":0,"entity_id":6861797,"created_by":218702,"created_at":"2025-06-03T17:26:00.000000Z","updated_at":"2025-06-03T17:26:00.000000Z","visibility_id":1,"updated_by":null,"is_pinned":0,"position":1,"settings":{"collapsed":"0"},"marketplace_uuid":null,"location_id":null,"layout_id":null,"deleted_at":null,"deleted_by":null,"is_template":0,"words":null}]}}