{"id":266520,"name":"Gods of Humans - Old Gods","created_at":"2024-10-31T17:34:33.000000Z","updated_at":"2024-10-31T17:43:13.000000Z","is_private":0,"note_id":266514,"entity":{"id":6862012,"entity_id":266520,"parent_id":null,"type_id":6,"name":"Gods of Humans - Old Gods","type":"Religion","entry":"<p><b>Aengus Óg (AY-ngus OAG)<\/b><\/p><p>Aengus Óg is a <b>god of youth, love, and music<\/b>. He is known for his beauty and charm, and is often depicted playing a harp or surrounded by beautiful women. Aengus Óg is also a <b>skilled warrior and a powerful leader<\/b>. He is associated with the <b>Otherworld<\/b>, a mystical realm beyond the mortal world.<\/p><p><b>Badb (BAHB)<\/b><\/p><p>Badb is a <b>war goddess<\/b>, often associated with <b>death and destruction<\/b>. She is a powerful and fearsome figure, and is often depicted as a crow or a hag. Badb is believed to appear on the battlefield, feasting on the blood of the slain. She is also associated with the <b>Otherworld<\/b>, and is sometimes seen as a <b>protector of the dead<\/b>.<\/p><p><b>Brigid (BRIG-id)<\/b><\/p><p>Brigid is a goddess of <b>healing, poetry, and smithcraft<\/b>. She is a kind and compassionate deity, and is often invoked to protect against illness and to inspire creativity. Brigid is often depicted as a beautiful woman, carrying a staff and a cauldron. She is associated with the hearth and the home, and is considered a patron of women and children.<\/p><p><b>Cu Chulainn (KOO KOO-lahn)<\/b><\/p><p>Cu Chulainn is a legendary hero, known for his great <b>strength and courage<\/b>. He is a skilled warrior and a powerful leader. Cu Chulainn is often depicted as a young and handsome man, carrying a spear and a shield. He is said to have possessed superhuman strength and ferocity in battle. Cu Chulainn is a central figure in the Irish epic tale, the Táin Bó Cúailnge.<\/p><p><b>Dagda (DAHG-dah)<\/b><\/p><p>The Dagda is the chief god of the Tuatha Dé Danann, a race of divine beings who are said to have ruled before the arrival of the Milesians. He is a god of <b>fertility, abundance, and the land<\/b>. The Dagda is often depicted as a large and powerful figure, carrying a magical club that can bring life or death. He is associated with the Otherworld, and is sometimes seen as a guardian of the dead.<\/p><p><b>Fhoi Myore (Fhoi Myore)<\/b><\/p><p>A race of giant, decaying beings, harbingers of winter and death. While they don't have a single, named god of cold, they are more of a  collective presence and power represent the icy, destructive force they embody.<br><\/p><p><b>Lugh (LOOG)<\/b><\/p><p>Lugh is a <b>skilled warrior and craftsman<\/b>. He is the god of many arts and crafts, including <b>metalworking, carpentry, and poetry<\/b>. Lugh is also a skilled fighter and a powerful leader. He is often depicted as a young and handsome man, carrying a spear and a shield. Lugh is associated with the summer solstice, and is sometimes seen as a bringer of light and life.<\/p><p><b>Manannán Mac Lir (MA-nah-NAHN mak LIR)<\/b><\/p><p>Manannán mac Lir is a <b>god of the sea<\/b>, and is often associated with <b>sailors and fishermen<\/b>. He is a powerful and skilled warrior, and is often depicted riding a white horse or driving a chariot drawn by horses. Manannán mac Lir is also a <b>patron of healing and magic<\/b>. He is associated with the Otherworld, and is sometimes seen as a guardian of the sea. Side note: Mac Lir, meaning son of Lir, places this figure as one of the Children of Lir, a mythical figure whose remarriage to Aoife had tragic consequences for the children. <\/p><p><b>Morrigan (MOHR-ih-gahn)<\/b><\/p><p>The Morrigan is a complex and multifaceted goddess who appears in many different forms. She is often associated with <b>war, death, and sovereignty<\/b>. The Morrigan is a powerful and fearsome figure, but she is also a wise and protective deity. She is often depicted as a crow, a wolf, or a beautiful woman. The Morrigan is associated with the Otherworld, and is sometimes seen as a guardian of the dead.<\/p><p><b>Nuada (NOO-ah-dah)<\/b><\/p><p>Nuada is a <b>god of healing and crafts<\/b>. He is a skilled craftsman and a powerful warrior. Nuada is often depicted as a handsome man, carrying a silver hand. He is associated with the Tuatha Dé Danann, and is sometimes seen as a <b>patron of the arts<\/b>.<\/p>","is_private":0,"tooltip":null,"is_template":null,"is_attributes_private":0,"focus_x":null,"focus_y":null,"created_at":"2024-10-31T17:34:33.000000Z","updated_at":"2024-10-31T17:43:13.000000Z","created_by":218702,"updated_by":218702,"image_path":null,"image_uuid":"9d60edf3-e4c1-4fa4-aea2-6e2acf66e9de","header_image":null,"header_uuid":null,"marketplace_uuid":null,"posts":[{"id":783451,"name":"Children of Lir","entry":"<p>Lir was the father of Manannán mac Lir<\/p><p>When Lir's wife passed away, and he later remarried a woman named Aoife. However, Aoife grew jealous of Lir's love for his children and cast a cruel spell on them, transforming them into swans. This curse condemned them to centuries of suffering, forced to live as swans on various bodies of water.<\/p><p>The Children of Lir endured immense hardship, facing storms, hunger, and the harshness of the elements. Yet, they remained bound by their love for each other, enduring their trials with courage and resilience.<\/p>","is_private":0,"entity_id":6862012,"created_by":218702,"created_at":"2024-10-31T17:36:35.000000Z","updated_at":"2024-10-31T17:36:35.000000Z","visibility_id":1,"updated_by":null,"is_pinned":0,"position":1,"settings":{"collapsed":"0"},"marketplace_uuid":null,"location_id":null,"layout_id":null,"deleted_at":null,"deleted_by":null,"is_template":0,"words":null}]}}