{"id":266517,"name":"Gods of the Empire (Human)","created_at":"2024-10-31T16:39:11.000000Z","updated_at":"2024-12-16T16:25:20.000000Z","is_private":0,"note_id":266514,"entity":{"id":6861865,"entity_id":266517,"parent_id":null,"type_id":6,"name":"Gods of the Empire (Human)","type":"Religion","entry":"<p>These are intended to be accessible versions of the elven gods, but I'd like the human clerics to introduce a little more closed-mindedness into the mythos. The humans are pretty sure they know the gods better than the elves and maybe it's true. Humans are not frivolous and accomplish an incredible amount in any endeavor they focus on. <\/p><p>This is doubly true in their devotions.<\/p><hr><p><b>Apollo<\/b>: the radiant god of the <b>sun, music, poetry, prophecy, healing<\/b>,<b> and innovation<\/b>. Known for his golden bow and lyre, Apollo is often depicted as a beautiful and youthful deity. Apollo is bisexual, finding love and inspiration in both men and women. His love for the <b>arts and sciences<\/b> is boundless, and he often inspires mortal tinkerers and inventors with divine visions and guidance.<\/p><p>Beyond his artistic and intellectual pursuits, Apollo is also a fierce protector. He wields a purifying power that can cleanse both physical and spiritual ailments. His oracle are seekers of truth and wisdom can receive divine guidance. In this role, Apollo often uses his prophetic abilities to help those in need, even if it means challenging the established order..<br><\/p><p><b>Mercury:<\/b> <font color=\"#000000\"><span>the swift-footed messenger of the gods, is a <\/span><\/font><b>trickster, a traveler, and a god of commerce<\/b><font color=\"#000000\"><span>. Known for his winged sandals and his caduceus, Mercury is a versatile deity who can adapt to any situation and is decidedly genderfluid, shifting between masculine and feminine presentations. This fluidity is reflected in their domains, as they are equally comfortable in the bustling marketplace as they are in the quiet contemplation of philosophical thought.<\/span><\/font><\/p><p style=\"color:rgb(0,0,0);\">Mercury is a <b>patron of thieves<\/b>, but also of those who <b>seek knowledge and understanding<\/b>. They are often seen as a symbol of adaptability, intelligence, and communication. In this role, Mercury encourages their followers to embrace their individuality and to explore the world with curiosity and open-mindedness.<\/p><p><b>Juno: <\/b><span style=\"color:rgb(0,0,0);\"><b>the queen of the gods<\/b> and the goddess of <b>marriage, family, and childbirth<\/b>, is a powerful and complex figure. Often depicted as a jealous and possessive wife, but really is a more nuanced character. She is a strong and independent woman who is not afraid to express her sexuality. While her love for Jupiter is deep and passionate, she also values her own autonomy and is not afraid to challenge her husband when necessary.<\/span><\/p><p>Her Priestess remove their tongues at Higher levels so that they may listen to confessions and maintain privacy.<span style=\"color:rgb(0,0,0);\"><br><\/span><\/p><p style=\"color:rgb(0,0,0);\">Juno is a <b>protector of women and children<\/b>, and she often intervenes to help those who are in need. She is also a symbol of <b>fertility and abundance<\/b>, and she is often invoked in prayers for a bountiful harvest and healthy offspring.<\/p><p>Vulcan: <font color=\"#000000\"><span>the god of <\/span><\/font><b>fire, metalworking, and volcanoes<\/b><font color=\"#000000\"><span>, is a skilled <\/span><\/font><b>craftsman and inventor<\/b><font color=\"#000000\"><span>. Often depicted as a physically imposing figure, Vulcan is a gentle soul with a passion for his work. In this pantheon, Vulcan embraces his masculine identity, but some say she's presented as female to them. Despite facing challenges and prejudice, he perseveres, using his talents to create beautiful and functional objects.<\/span><\/font><\/p><p style=\"color:rgb(0,0,0);\">Vulcan's forge is a sacred place where he works tirelessly, often aided by his loyal assistants, the Cyclopes. His creations are sought after by gods and mortals alike, and he is often called upon to repair broken weapons and armor. In addition to his practical skills, Vulcan is also a <b>patron of artists<\/b> and <b>engineers<\/b>, inspiring them to push the boundaries of creativity and innovation.<\/p><p><b>Bacchus:<\/b> <span style=\"color:rgb(0,0,0);\">the god of <b>wine, revelry, and ecstasy<\/b>, is a wild and passionate deity. Often associated with <b>fertility, madness, and transformation<\/b>, Bacchus is a complex figure who challenges societal norms. In this pantheon, Bacchus blurs the lines, but in doing so tends to swing from one extreme to the other. This fluidity is reflected in their appearance, behavior, and the rituals associated with them.<\/span><\/p><p style=\"color:rgb(0,0,0);\">Bacchus's followers, known as Bacchants, engage in ecstatic rituals that involve drinking wine, dancing, and singing. These rituals are believed to connect individuals with the divine and to promote spiritual growth. Bacchus is a patron of <b>artists, musicians, and actors<\/b>, and they are often invoked to inspire creativity and passion.<\/p><p><b>Venus: <\/b><span style=\"color:rgb(0,0,0);\"><b>the goddess of love, beauty, and desire<\/b>, is a captivating figure. Often associated with <b>passion, sensuality, and fertility<\/b>, Venus is a symbol of both physical and spiritual love. In this pantheon, Venus is pansexual, finding love and attraction in all genders.<\/span><\/p><p style=\"color:rgb(0,0,0);\">Venus is a patron of <b>artists, poets, and lovers<\/b>. She inspires creativity and passion, and she is often invoked in prayers for love, beauty, and harmony. While Venus is often associated with romantic love, she also embodies the love of<b> friendship, family, and community<\/b>.<\/p><p><b>Mars:<\/b><span style=\"color:rgb(0,0,0);\"><b> the god of war<\/b>, is a powerful and fearsome deity. Often associated with v<b>iolence, aggression, and bloodshed<\/b>, Mars is a complex figure who represents both the destructive and creative aspects of conflict. <\/span><span style=\"color:rgb(0,0,0);\">While Mars is a god of war, they are also a <b>patron of soldiers and athletes<\/b>. They inspire courage, discipline, and a competitive spirit. Mars is often depicted as a skilled warrior, and their battles are legendary. Despite their warlike nature, Mars also values honor, loyalty, and strategic thinking.<\/span><\/p><p><b>Diana: <\/b><span style=\"color:rgb(0,0,0);\"><b>the goddess of the hunt, the moon, and the wilderness<\/b>, is a powerful and independent figure. Often depicted as a skilled archer and a fierce protector of nature, Diana is a symbol of both strength and grace. <\/span><span style=\"color:rgb(0,0,0);\">Diana is a patron of <b>hunters, gatherers, and those who seek solitude<\/b> and connection with nature. She is often invoked to protect against harm and to inspire courage and self-reliance. Diana is also associated with the <b>moon<\/b>, and she is believed to <b>influence the tides, the weathe<\/b>r, and the human psyche.<\/span><\/p><p><b>Pluto: <\/b><span style=\"color:rgb(0,0,0);\"><b>the god of the underworld<\/b>, is a mysterious and powerful figure. Often associated with <b>death, rebirth, and transformation<\/b>, Pluto rules over the realm of the dead and is said to control the changing of the seasons. Offerings the Pluto are common at the solstices<\/span><\/p><p style=\"color:rgb(0,0,0);\">Pluto's domain is a vast and complex place, filled with both wonder and terror. They are a judge of the dead, determining the fate of each soul. While Pluto is often associated with darkness and decay, they also represent the cycle of life and death.<\/p><p><b>Neptune: <\/b><span style=\"color:rgb(0,0,0);\"><b>the god of the sea, earthquakes, and horses<\/b>, is a powerful and unpredictable deity. Often depicted as a bearded man with flowing hair and a trident, Neptune rules over the vast oceans and the creatures that dwell within them.  Neptune is polyamorous, forming multiple loving relationships with both men and women and often said to be a collector or lovers.<\/span><\/p><p style=\"color:rgb(0,0,0);\">Neptune's domain is a realm of <b>mystery and danger<\/b>, filled with both beauty and terror. He is often invoked by <b>sailors and fishermen<\/b>, who seek his protection and guidance. Neptune is also associated with horses, and he is often depicted riding a chariot drawn by sea horses.<\/p><p><b>Jupiter: <\/b><span style=\"color:rgb(0,0,0);\"><b>the king of the gods<\/b> and the god of the <b>sky and thunder<\/b>, is a powerful and imposing figure. Often depicted as a bearded man wielding a lightning bolt, Jupiter rules over the pantheon. In this pantheon, Jupiter is  known for dabbling in many affairs, both divine and mortal.<\/span><\/p><p style=\"color:rgb(0,0,0);\">Jupiter's power is immense, and he is often invoked to <b>protect cities, nations, and individuals<\/b>. He is a symbol of authority, justice, and divine order. Despite his many flaws, Jupiter strives to maintain balance and harmony in the universe.<\/p>","is_private":0,"tooltip":null,"is_template":null,"is_attributes_private":0,"focus_x":null,"focus_y":null,"created_at":"2024-10-31T16:39:11.000000Z","updated_at":"2024-12-16T16:25:20.000000Z","created_by":218702,"updated_by":218702,"image_path":null,"image_uuid":"9d60e403-646e-4d3c-a348-077631ba0c53","header_image":null,"header_uuid":null,"marketplace_uuid":null}}