{"id":1519244,"name":"Kashal","created_at":"2024-10-15T17:06:00.000000Z","updated_at":"2025-02-13T22:26:38.000000Z","is_private":0,"is_destroyed":0,"location_id":null,"entity":{"id":6800997,"entity_id":1519244,"parent_id":null,"type_id":3,"name":"Kashal","type":"City","entry":"<p dir=\"ltr\"><span style=\"font-size:11pt;font-family:'Open Sans', sans-serif;color:rgb(105,93,70);background-color:transparent;font-weight:400;font-style:normal;text-decoration:none;\">To see the locations inside <\/span>[location:6800997] click <a href=\"https:\/\/app.kanka.io\/w\/273979\/locations?parent_id=1519244\">here<\/a>.<\/p><p dir=\"ltr\"><span style=\"font-size:11pt;font-family:'Open Sans', sans-serif;color:rgb(105,93,70);background-color:transparent;font-weight:400;font-style:normal;text-decoration:none;\">To read a long winded description of the great city from the lips of <\/span>[character:6801009], strap in... read on:<\/p><p dir=\"ltr\"><span style=\"font-size:11pt;font-family:'Open Sans', sans-serif;color:rgb(105,93,70);background-color:transparent;font-weight:400;text-decoration:none;\"><i>Below the praetorian palace lies the great city, capital of an empire, rich in gold and fame, the home of adventurers, merchants, poets, playwrights, magicians, alchemists, engineers, scientists, philosophers, craftsmen of every sort, senators, scholars—there is a great University— theologians, painters, actors, buccaneers, moneylenders, highwaymen, dancers, musicians, astrologers, architects, ironmasters, masters of the great manufactories on the outskirts of Kashal's capital, prophets, exiles from foreign lands, animal trainers, peacekeepers, judges, physicians, gallants, flirts, great ladies, and noble lords; all bustle together in the city's alehouses, ordinaries, theaters, opera houses, inns, concert halls; its forums, its wine shops and places of contemplation, parading fantastic costumes, resisting conformity at any cost, so that even the wit of the city's urchins is as sharp as the finest conversation of the rural lord; the vulgar speech of the street bullies is so full of metaphor and condensed reference that an ancient poet would have given his soul to possess the tongue of a Kashal apprentice; yet it is a speech almost impossible to translate, more mysterious than cuniform, and its fashions change from day to day. <\/i><\/span><\/p><p dir=\"ltr\"><span style=\"font-size:11pt;font-family:'Open Sans', sans-serif;color:rgb(105,93,70);background-color:transparent;font-weight:400;text-decoration:none;\"><i>Moralists decry these habits, this perpetual demand for mere empty novelty, and argue that decadence looms, the inevitable result of sensation-seeking, yet the demand on the artists for novelty, while it certainly means that bad artists produce only fresh and shallow sensation, causes the best of them to fire their plays with a language that is vital and complex (for they know it will be understood), with events that are melodramatic and fabulous (for they know they will be believed), with argument on almost any subject (for there are many who will follow them).<\/i><\/span><\/p><p dir=\"ltr\"><span style=\"font-size:11pt;font-family:'Open Sans', sans-serif;color:rgb(105,93,70);background-color:transparent;font-weight:400;text-decoration:none;\"><i>So it is, too, for the best musicians, poets, philosophers—not excluding those lowly writers of prose who would claim legitimacy for what everyone knows is a bastard art. In short, our Kashal is alive at every level; even its vermin, one might suspect, is articulate and flea discourses with flea on the question whether the number of dogs in the universe is finite or infinite, while rats wrangle over such profundities as which came first, the baker or the bread. And where language catches fire, so are deeds performed to match, and the deeds, in turn, color the language. <\/i><\/span><\/p><p dir=\"ltr\"><span style=\"font-size:11pt;font-family:'Open Sans', sans-serif;color:rgb(105,93,70);background-color:transparent;font-weight:400;text-decoration:none;\"><i>Great deeds are done in this city, in the name of its Praetor, whose palace looks down upon it. Expeditions set forth and discoveries are made. Inventors and explorers enrich the Realm twin rivers flow into the city, one of Knowledge, one of Gold, and the lake they form is the stuff of Kashal, equal parts intermingled. <\/i><\/span><\/p><p dir=\"ltr\"><span style=\"font-size:11pt;font-family:'Open Sans', sans-serif;color:rgb(105,93,70);background-color:transparent;font-weight:400;text-decoration:none;\"><i>And there is conflict, of course, and crime here-the passions are high and heady, the crimes are fierce and horrible, for the stakes can be enormous; greed is a giant, ambition is Faith to more than a few—a drug, a disease, a cup that can never be drained. Yet there are many, too, who have learned the virtues of the rich; who are enlightened, humane, charitable, generous; who live according to the highest Stoic tradition; who display their nobility and offer themselves as examples to their fellows, both rich and poor; who are mocked for their gravity, hated for their humility, envied for their self-sufficiency. <\/i><\/span><\/p><p dir=\"ltr\"><span style=\"font-size:11pt;font-family:'Open Sans', sans-serif;color:rgb(105,93,70);background-color:transparent;font-weight:400;text-decoration:none;\"><i>Pompous piety, some would call their state, and so it is, for some of them, those without humor, without irony. These proud princelings and captains of industry, merchant adventurers, priests and scholars follow a code, but they are individuals nonetheless-even eccentrics-though all would serve the Nation and Empire (in the person of their Praetor) at any cost to themselves, even, should necessity demand, with their lives, for the Empire is All and the Praetor is Just. Only secondly, to a man and woman, would they consult private conscience, on any matter whatsoever, for they would deem all personal decisions subservient to the needs of the Empire.<\/i><\/span><span style=\"font-size:11pt;font-family:'Open Sans', sans-serif;color:rgb(105,93,70);background-color:transparent;font-weight:400;font-style:normal;text-decoration:none;\"> - <\/span>[character:6801009]<\/p><p><span id=\"docs-internal-guid-ee0617d0-7fff-7a4b-f988-33758dd095a7\" style=\"color:rgb(0,0,0);\"><\/span><br class=\"Apple-interchange-newline\" style=\"color:rgb(0,0,0);\"><\/p>","is_private":0,"tooltip":null,"is_template":null,"is_attributes_private":0,"focus_x":null,"focus_y":null,"created_at":"2024-10-15T17:06:00.000000Z","updated_at":"2025-02-13T22:26:38.000000Z","created_by":218702,"updated_by":218702,"image_path":null,"image_uuid":"9d40b6d6-012e-45b0-9d38-be77cfd97caf","header_image":null,"header_uuid":null,"marketplace_uuid":null,"posts":[{"id":856128,"name":"Beneath the City is Another","entry":"<p>Indeed, this city was built atop and older city to the point that there are passages ways to be found beyond the grates and blocked off hallways of the that palace that adjoin to the crypts, tombs and sewers of the undercity. These are known to but a few.<\/p><p><b>NOTES<\/b><\/p><ul><li>[character:6881914] - the advisor to two generations of Praetor, he knows that the are shadow courts below the city. There the henchmen of the olden days, while older, still thrive.<\/li><li>[character:6809263] and the [family:6801053|Drip Monks] - Yep, even these innocent guys know of the undercity, but they don't know the extent of it. Only that queer things live there.<\/li><li><b>Case of the Black Onyx<\/b> - Under the city the party will find a map\/puzzle that will allow them to locate and take on the strongest of the [family:6884341], [character:6884348] and live to regret it. <\/li><\/ul>","is_private":0,"entity_id":6800997,"created_by":218702,"created_at":"2025-02-13T22:26:38.000000Z","updated_at":"2025-02-13T22:26:38.000000Z","visibility_id":2,"updated_by":null,"is_pinned":0,"position":1,"settings":{"collapsed":"1"},"marketplace_uuid":null,"location_id":null,"layout_id":null,"deleted_at":null,"deleted_by":null,"is_template":0,"words":null}],"mentions":[{"entity_id":6800997,"campaign_id":null,"post_id":null,"timeline_element_id":null,"quest_element_id":null,"target_id":6801009},{"entity_id":6800997,"campaign_id":null,"post_id":856128,"timeline_element_id":null,"quest_element_id":null,"target_id":6881914},{"entity_id":6800997,"campaign_id":null,"post_id":856128,"timeline_element_id":null,"quest_element_id":null,"target_id":6809263},{"entity_id":6800997,"campaign_id":null,"post_id":856128,"timeline_element_id":null,"quest_element_id":null,"target_id":6801053},{"entity_id":6800997,"campaign_id":null,"post_id":856128,"timeline_element_id":null,"quest_element_id":null,"target_id":6884341},{"entity_id":6800997,"campaign_id":null,"post_id":856128,"timeline_element_id":null,"quest_element_id":null,"target_id":6884348}]}}