{"id":266513,"name":"2. Species","created_at":"2024-10-31T15:44:47.000000Z","updated_at":"2025-05-14T17:16:11.000000Z","is_private":0,"note_id":265028,"entity":{"id":6861690,"entity_id":266513,"parent_id":null,"type_id":6,"name":"2. Species","type":"Meta","entry":"<p>This is a quick overview of the races, classes etc and where they fit into the world. Yes, it's possible to be from a far-away land, but this is for those who want some background on immediate area and (for RP reasons) want to place their character with in the context of the region were alot of gameplay will take place.<\/p><ul><li><b>Elves<\/b> - The 'local' elves come from <span id=\"docs-internal-guid-bb168989-7fff-8d80-728b-fac674c0744a\"><font color=\"#695d46\"><span style=\"font-size:11pt;\">CaerCylwen, (the High City) but the city is called \"Grugain\" in the common tongue. They worship the <\/span><\/font><\/span>[note:6861797|Gods]<span><font color=\"#695d46\"><span style=\"font-size:11pt;\"> you'd know from the greek mythology and while they don't exactly keep to themselves they seem unable to adapt to city life in <\/span><\/font><\/span>[location:6800997] where things move at a different pace and manors seem optional. Of course, other elves exist, but if you want to tie into local world, these are the elves. -- Ask me about some fantastic and fun reading I have about the greek gods. I'll lend you a book.<\/li><li><b>Dwarves<\/b> - Since they seem to prefer areas of geological interest where they might find ores, gems and the treasures of the earth you'll find them mainly in the surrounding mountains or Ore pits like [location:6911493]. The do come to the city of [location:6800997], particularly those involved in stone craft, metal work and commerce, but their kind are often drawn back to their roots in the earth. By and large, the dwarves worship the what you and I know as the [note:6861837|Old Norse Gods]<\/li><li><b>Gnomes<\/b> - They tend to live in forest and in rocky forbidding places preferring isolation to being bullied and pestered. Those who do venture out into the bigger world are peculiarly secure in their own skins and make good adventuring companions known for their prudence and adventuring spirits in equal measure. [<i>Need some lore, we can make it together<\/i>] I'm inclined to give the gnomes the [note:6862012|Old Gaellic gods] and this would give the Gnomes some common grounds with the people of [location:6821563]<\/li><li><b>Half Elves<\/b> - Have to work hard building community because each half seems to think of them as the worst of both parts. Prejudiced folk tend to put them down and they sometimes find themselves wandering rather than settling into a community. They may practice the worship of the [note:6861797] or the the [note:6862012|old ways], or [note:6861865|new ways] of the Humans.<\/li><li><b>Halflings<\/b> - They are a queer sort with some communities ignoring gods and government. They adopt either the [note:6862012|old ways], or [note:6861865|new ways] and that seems to be fine with everyone in charge who largely ignore them. Really, they are no friendly, offer no fuss and primarily live agriculturally motivate lives in lovely pastoral (Shire-like) settings.<\/li><li><b>Human <\/b>- Humans come in all sorts and shapes, but locally, they either follower of the [note:6862012|old ways], or [note:6861865|new ways] the distinction being that the empire conquered those who were in the valley before making them mostly second class citizens. The new empire is controlled by the [organisation:6801105] and stratified into classes starting Peregrini (free born of the conquered lands) and including Plebians, Patricians, Equestrians and at the pinnacle Senators. <\/li><li><b>Other Races<\/b> - Let workshop them together.<\/li><li><b>Tieflings<\/b> - as ever, they are looked on with suspicion, but many of the [note:6861765|religions] practiced in the valley have myths and legends like Hades and Persephone which normalizes the stigma of being from Hell to a great degree. Let's just say opinions vary, about tieflings. Sure they are different, but they are understandable different and perhaps even messengers of the Underworld.<\/li><li><b>Warforged<\/b> - A small group of warforged were encountered over a decade ago and enslaved by the Empire. Many of them work in the the most menial of jobs because they don't complain and feel that they deserver to be enslaved, but there are exceptions, including Calvin's warforged who has a slightly different provenance.<\/li><\/ul><p><br><\/p>","is_private":0,"tooltip":null,"is_template":null,"is_attributes_private":0,"focus_x":null,"focus_y":null,"created_at":"2024-10-31T15:44:47.000000Z","updated_at":"2025-05-14T17:16:11.000000Z","created_by":218702,"updated_by":218702,"image_path":null,"image_uuid":"9d60f126-133a-48a2-b67d-d4da3101e0c4","header_image":null,"header_uuid":null,"marketplace_uuid":null,"mentions":[{"entity_id":6861690,"campaign_id":null,"post_id":null,"timeline_element_id":null,"quest_element_id":null,"target_id":6861797},{"entity_id":6861690,"campaign_id":null,"post_id":null,"timeline_element_id":null,"quest_element_id":null,"target_id":6800997},{"entity_id":6861690,"campaign_id":null,"post_id":null,"timeline_element_id":null,"quest_element_id":null,"target_id":6862012},{"entity_id":6861690,"campaign_id":null,"post_id":null,"timeline_element_id":null,"quest_element_id":null,"target_id":6861865},{"entity_id":6861690,"campaign_id":null,"post_id":null,"timeline_element_id":null,"quest_element_id":null,"target_id":6801105},{"entity_id":6861690,"campaign_id":null,"post_id":null,"timeline_element_id":null,"quest_element_id":null,"target_id":6861765},{"entity_id":6861690,"campaign_id":null,"post_id":null,"timeline_element_id":null,"quest_element_id":null,"target_id":6911493},{"entity_id":6861690,"campaign_id":null,"post_id":null,"timeline_element_id":null,"quest_element_id":null,"target_id":6861837},{"entity_id":6861690,"campaign_id":null,"post_id":null,"timeline_element_id":null,"quest_element_id":null,"target_id":6821563}]}}